package absoft;
/*
Написать программу которая будет выводить цифры от 1 до 5 используя цикл for
 */

public class test6_for {
    public static void main(String[] args) {
        int from = 1;
        int to = 5;

        for (int i = from; i <= to; i++) {
            System.out.print(i + " ");
        }
        System.out.println();

    }

}
